# ***DATA 3500*** *: Python 2*

## **Introduction to pandas and Intermediate Python**
  - We will introduce one of the most widely used lilbraries today and look at some of the basic features.
  - We will continue to look at more advanced uses of Python.

pandas, imported with **import pandas as pd** adopts many coding idioms from Numpy, but the biggest difference is that pandas is designed for working with tabular or heterogeneous data. Numpy, by contrast, is best suited for working with homogeneous numerical array data.

## **Introduction to pandas Data Structures**

To get started with pandas, you will need to understand its two primary data structures: **Series** and **DataFrame**. These two data structures provide a solid, easy-to-use basis for most data science applications.

## **Series**

A series is a one-dimenstional array-like object containing a sequence of values (of similar types to numpy types) and an associated array of data labels, called its **index**. The simplest series is formed from only an array of data:

In [1]:
# Remember to import your libraries.
# The number you see on the left is the index and the value is on the right.

import pandas as pd

obj = pd.Series([4, 7, -5, 2])
obj

0    4
1    7
2   -5
3    2
dtype: int64

In [2]:
# Often is it desirable to create a series with an index for each data point.

obj2 = pd.Series([4, 2, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    2
a   -5
c    3
dtype: int64

In [3]:
# We can use index values to select observations.

obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [4]:
# We can use numpy-like operations such as filtering, multiplication, or applying math functions.

# filtering
print(obj2[obj2 > 0])

# multiplication
print(obj2 * 2)

# math functions
import numpy as np
print(np.exp(obj2))

d    4
b    2
c    3
dtype: int64
d     8
b     4
a   -10
c     6
dtype: int64
d    54.598150
b     7.389056
a     0.006738
c    20.085537
dtype: float64

## **Dictionaries**

Often just referred to as **dict**, it is one of the most important built-in Python data structures. It is a flexibly sized collection of **key-value** pairs, where **key** and **value** are Python objects. One approach to creating one is to use curly braces **{}** and colons **:** to separate **keys** and **values**.

In [5]:
# Start with a simple dictionary
# {key:value, ...}

d1 = {'a' : 'some value', 'b': [1, 2, 3, 4]}
d1['b']

[1, 2, 3, 4]

In [6]:
# How we accomplish something with a list.

pop = [30.55, 2.77, 39.21]
countries = ['afghanistan', 'albania', 'algeria']
alb = countries.index('albania')
pop[alb]

2.77

In [7]:
# Apply the dictionary to our list populations and countries
# Set this up with key:value pairs.

world = {'afghanistan':30.55, 'albania':2.77, 'algeria':39.21}
world['albania'] # pass the key in square brackets.

2.77

### **Try problem #1**

In [9]:
d1

{'a': 'some value', 'b': [1, 2, 3, 4], 7: 'an integer'}

In [8]:
# You can access, insert, or set elements using the same syntax as for accessing elements of a list.
# In the below example, 7 becomes the key and 'an integer' becomes the value.

# insert an element
d1[7] = 'an integer'
print(d1)

# access an element
print(d1[7])

{'a': 'some value', 'b': [1, 2, 3, 4], 7: 'an integer'}
an integer

In [10]:
# We can also check to see if a dict contains a key.

'b' in d1

True

In [11]:
# We can delete values with del or the pop method (which returns a value and deletes the key)

# del
print(d1)
d1[5] = 'some value'
print(d1)
d1['dummy'] = 'another value'
print(d1)
del d1[5]
print(d1)

# pop
ret = d1.pop('dummy')
print(ret)
print(d1)

{'a': 'some value', 'b': [1, 2, 3, 4], 7: 'an integer'}
{'a': 'some value', 'b': [1, 2, 3, 4], 7: 'an integer', 5: 'some value'}
{'a': 'some value', 'b': [1, 2, 3, 4], 7: 'an integer', 5: 'some value', 'dummy': 'another value'}
{'a': 'some value', 'b': [1, 2, 3, 4], 7: 'an integer', 'dummy': 'another value'}
another value
{'a': 'some value', 'b': [1, 2, 3, 4], 7: 'an integer'}

### **Try problem #2**

### **Try problem #3**

### **Try problem #4**

## **Using Dictionaries within pandas**

In [12]:
# If you have data in a dictionary, we can create a Series from that.

import pandas as pd

sdata = {'Ohio': 35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [13]:
# The above keys are in the order of the dictionary.
# We can specify any order we want.

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Above we have the values from sdata in the appropriate locations, but because no value exists for 'California' it appears as **NaN** (not a number), which is considered in pandas to mark missing or NA values. Since 'Utah' was not included in the **states** list, it is excluded from the resulting object.

In [14]:
# We can use isnull and notnull functions from pandas to detect missing data.
# Notice that they give you opposite results.

print(pd.isnull(obj4))
print(pd.notnull(obj4))

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

## **DataFrame**

A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc...). The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index. The data is stored as one or more two-dimensional blocks rather than a list, dict, or some other collection one-dimensional arrays.

There are many ways to create a DataFrame.

One way to think of a DataFrame is like an excel file with rows and columns.

In [15]:
# Creating a DataFrame from a dict of equal-length lists or numpy arrays.

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2004],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2004  3.2

In [19]:
# What if we have a large dataset that we do not want to type out?
# We can import data as well.

brics = pd.read_csv('country.csv')
brics

  Unnamed: 0         country        capital   area  population
0         UK  United Kingdom         London   4.22       42.20
1         RU          Russia         Moscow  17.00      144.90
2         US   United States  Washington DC  11.20      724.20
3         CH           China        Beijing   9.62     1341.00
4         CA          Canada         Ottawa  14.60       39.72

In [20]:
# The row labels are seen as a column which isn't correct.
# We can correct this by telling pandas that the first column contains row indexes.

brics = pd.read_csv('country.csv', index_col = 0)
brics

           country        capital   area  population
UK  United Kingdom         London   4.22       42.20
RU          Russia         Moscow  17.00      144.90
US   United States  Washington DC  11.20      724.20
CH           China        Beijing   9.62     1341.00
CA          Canada         Ottawa  14.60       39.72

### **Try problem #5**

### **Try problem #6**

In [21]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2004  3.2

In [22]:
# For large DataFrames, the head method selects the first 5 rows.

frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [23]:
# The tail method selects the last 5 rows.

frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2004  3.2

In [24]:
# The sample method selects n random rows.

frame.sample(3)

    state  year  pop
3  Nevada  2001  2.4
2    Ohio  2002  3.6
5  Nevada  2004  3.2

In [25]:
# you can specify a sequence of columns and the DataFrame will be arranged in that order.

pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2004  Nevada  3.2

In [26]:
# If you pass a column that is not in the dict/data, it will appear with missing values.

frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2004  Nevada  3.2  NaN

In [27]:
# Lets recreate frame2 with specific index values

frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                      index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2004  Nevada  3.2  NaN

In [28]:
# A column in a DataFrame can be retrieved two ways.

frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [29]:
# or...

frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [30]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2004  Nevada  3.2  NaN

In [31]:
# We can retrieve rows by position or name with the special loc atribute.

frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [32]:
# Columns can be modified by assignment.
# For example, the empty 'debt' column.

frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2004  Nevada  3.2  16.5

In [33]:
# We can assign different values to each observation as well.
# We already imported numpy above.

frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2004  Nevada  3.2     5

In [34]:
# Assigning a column that does not exist will create a new column.
# Below create a new column called eastern and assign True to each observation of Ohio.

frame2['eastern'] = (frame2['state'] == 'Ohio')
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5     0     True
two    2001    Ohio  1.7     1     True
three  2002    Ohio  3.6     2     True
four   2001  Nevada  2.4     3    False
five   2002  Nevada  2.9     4    False
six    2004  Nevada  3.2     5    False

In [35]:
# We can remove this column with del.

del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2004  Nevada  3.2     5

In [36]:
# Another common form of data is the nested dict of dicts.

pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [37]:
# We can sort by index.
# This is not a permanent sort though.

print(frame3.sort_index())
print(frame3)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [38]:
# We use inplace=True to make it permanent.

frame3.sort_index(inplace=True)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [39]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [40]:
# We can transpose the DataFrame (swap rows and columns) as well.

frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [41]:
# We can reindex which creates a new object with a new index.

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [42]:
# Calling reindex rearranges the new index.
# Missing values are introduced in any index values were not already present.

obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [43]:
# If data is ordered, it may be desireable to do some interpolation or fill in missing values.
# We can accomplish this with options such a ffill which forward fills values.

obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 3, 4])
obj3

0      blue
3    purple
4    yellow
dtype: object

In [44]:
obj3.reindex(range(8), method='ffill')

0      blue
1      blue
2      blue
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
dtype: object

## **Dropping Entries from an Axis**

Dropping one or more entries from an axis is easy if you already have an index array or list without those entries. The drop method will reutrn a new object with the indicated value or values deleted from an axis.

In [45]:
# Set up a Series to work with.
# Make the series fill with floats.

obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [46]:
# Drop row c.

new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [47]:
# Drop rows c and d.

obj.drop(['c', 'd'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [48]:
# With a DataFrame, we can delete values from either axis.
# Create a new DataFrame to work with.

data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
# Calling drop on a DataFrame will drop values from the row labels.

data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
# You can drop values from the columns by passing axis = 1 or axis = 'columns'.

data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [51]:
# Using the axis = 'columns' option.

data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [52]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [53]:
# If we want this to be a permanent change, we must use inplace=True.
# Be careful when using inplace, it destroys the original data and replaces it with the new.

print(obj)

obj.drop('d', inplace=True)
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
c    2.0
e    4.0
dtype: float64

## **Indexing, Selecting, and Filtering**

Series indexing (**obj[...]**) works analogously to numpy array indexing, except you can use the Series index values instead of only integers.

In [54]:
# Lets move on to working with DataFrames.

data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
# Select column 'two'.
# This is no longer a DataFrame though.

data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [56]:
# If we want to keep this as a DataFrame, we must use [[]].

data[['two']]

          two
Ohio        1
Colorado    5
Utah        9
New York   13

In [57]:
# Select columns 'three' and 'one'.
# And we can again keep this as a DataFrame with [[]].

data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [58]:
# Select the first two rows of data and keep all columns.

data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [59]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
# Select only those rows where the column 'three' is greater than 5.

data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [61]:
# We can produce a boolean DataFrame by scalar comparison.

data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [62]:
# We can take advantage of this to replace only specific values.

data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## **Selection with loc and iloc**

For DataFrame label-indexing on the rows, the special indexing operators for **loc** and **iloc** are introduced. They enable you to select a subset of the rows and columns from a DataFrame with numpy-like notation using either axis labels (**loc**) or integers (**iloc**).

In [63]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [64]:
# Select a single row by label with loc.

data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [65]:
# We can maintain the DataFrame with [[]].

data.loc[['Colorado']]

          one  two  three  four
Colorado    0    5      6     7

In [66]:
# We can select multiple rows and maintain a DataFrame.

data.loc[['Ohio', 'Utah']]

      one  two  three  four
Ohio    0    0      0     0
Utah    8    9     10    11

In [67]:
# We can extend this to only keep specific rows as well.

data.loc[['Ohio', 'Utah'], ['one', 'three']]

      one  three
Ohio    0      0
Utah    8     10

In [68]:
# Finally, we can keep all rows and only some columns.

data.loc[:, ['one', 'three']]

          one  three
Ohio        0      0
Colorado    0      6
Utah        8     10
New York   12     14

To recap:
- Square brackets
    - Column access data[['row', 'column]]
    - Row access only through slicing data[1:4]
- loc (label-based)
    - Row access data.loc[['row labels']]
    - Column access data.loc[:, ['row labels', 'column labels']]

In [69]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
# Make a selection using integers and iloc.
# Select row location 2 (3rd row) and columns locations 3 (4th column), 
# 0 (1st column), and 1 (2nd column). 

data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [71]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
# Select all of row location 2.

data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [73]:
# Select row location 1 and 2 and column locations 3, 0, and 1.
# Double brackets results in a DataFrame.

data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [74]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
# We can index with slices in addition to single labels or lists of labels.
# Select all rows through 'Utah' and select column 'two'

data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [ ]:
data

In [76]:
# Select all rows and column index 0 through 2.
# Within this set, select only rows where 'three' > 5.

data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### **Try problem #7**

### **Try problem #8**

### **Try Problem #9**

## **Loops**

Loops, such as while loops and for loops, are somewhat similar to our use of if, else, and elif statements. We do something until a condition is met. With the if, else, elif statements, Python will go through the code one time until it meets the condition and then move on to the next set of code. That is not the case with loops. A while loop will continue to execute code as long as a condition is true.

In [77]:
# Consider a simple while loop.
# Lets keep adding numbers together until they reach 100 or more.
# If we start with 10, it becomes (10 + 10), then (20 + 20), then (40 + 40), and finally (80 + 80)

number = 10

while number < 100:
    number = number + number
    print(number)

20
40
80
160

### **Try Problem #10**

In [78]:
# We now look at for loops which have the setup: for each variable in a sequence, execute code. 
# Let us look at the fam list and print each item out individually.

fam = [1.73, 1.68, 1.71, 1.89]
print(fam[0])
print(fam[1])
print(fam[2])
print(fam[3])

1.73
1.68
1.71
1.89

In [79]:
# We can also do this with a for loop.
# height is arbitrary, we can call it whatever we want.

for height in fam:
    print(height)

1.73
1.68
1.71
1.89

In [80]:
# We can loop over a string as well.
# This will iterate over every character in a string.

for c in 'family':
    print(c.capitalize())

F
A
M
I
L
Y

### **Try Problem #11**

In [81]:
# We can loop over a dictionary as well.
# Print each key and value pair.

world = {'afganhistan': 30.55,
       'albania': 2.77,
       'algeria': 39.21}

for k, v in world.items():
    print(k + ' population is ' + str(v))

afganhistan population is 30.55
albania population is 2.77
algeria population is 39.21

In [83]:
# We can loop over a DataFrame as well.
# This is the most widely used setup.

brics = pd.read_csv('country.csv', index_col = 0)
brics

           country        capital   area  population
UK  United Kingdom         London   4.22       42.20
RU          Russia         Moscow  17.00      144.90
US   United States  Washington DC  11.20      724.20
CH           China        Beijing   9.62     1341.00
CA          Canada         Ottawa  14.60       39.72

In [84]:
# Write a for loop to print each row.
# We must specify that we want to iterate over each row.

for label, row in brics.iterrows():
    print(label)
    print(row)
    print('')

UK
country       United Kingdom
capital               London
area                    4.22
population              42.2
Name: UK, dtype: object

RU
country       Russia
capital       Moscow
area            17.0
population     144.9
Name: RU, dtype: object

US
country       United States
capital       Washington DC
area                   11.2
population            724.2
Name: US, dtype: object

CH
country         China
capital       Beijing
area             9.62
population     1341.0
Name: CH, dtype: object

CA
country       Canada
capital       Ottawa
area            14.6
population     39.72
Name: CA, dtype: object

In [85]:
# We can print the label and capital together as an example.

for l, r in brics.iterrows():
    print(l + ': ' + r['capital'] + ', ' + r['country'])

UK: London, United Kingdom
RU: Moscow, Russia
US: Washington DC, United States
CH: Beijing, China
CA: Ottawa, Canada

In [86]:
brics

           country        capital   area  population
UK  United Kingdom         London   4.22       42.20
RU          Russia         Moscow  17.00      144.90
US   United States  Washington DC  11.20      724.20
CH           China        Beijing   9.62     1341.00
CA          Canada         Ottawa  14.60       39.72

In [87]:
# Add a row to the DF that contains the number of letters each country.

for l, r in brics.iterrows():
    brics.loc[l, 'name_length'] = len(r['country'])
brics

           country        capital   area  population  name_length
UK  United Kingdom         London   4.22       42.20         14.0
RU          Russia         Moscow  17.00      144.90          6.0
US   United States  Washington DC  11.20      724.20         13.0
CH           China        Beijing   9.62     1341.00          5.0
CA          Canada         Ottawa  14.60       39.72          6.0

In [98]:
# We can also use .apply() to apply our function to each row.
# This is more efficient code and easier to read.

brics['name_failed'] = len(brics['country'])
brics['name_length_apply'] = brics['country'].apply(len)
brics

,country,capital,area,population,name_length,name_length_apply,name_failed
UK,United Kingdom,London,4.22,42.20,14.0,14,5
RU,Russia,Moscow,17.00,144.90,6.0,6,5
US,United States,Washington DC,11.20,724.20,13.0,13,5
CH,China,Beijing,9.62,1341.00,5.0,5,5
CA,Canada,Ottawa,14.60,39.72,6.0,6,5

### **Try Problem #12**

### **Try Problem #13**

## **If, Elif, and Else Statements**

In [94]:
# Using if, elif, or else statements.
# These are known as conditional statements.

z = 6

if z % 2 == 0:
    print('z is even')

z is even

In [95]:
# We can expand this statement.

z = 6

if z % 2 == 0:
    print('checking value: ' + str(z))
    print('z is even')

checking value: 6
z is even

In [99]:
# What if we want something to happen when z is odd?
# We can use an else statement.

z = 7

if z % 2 == 0:
    print('z is even')
else:
    print('z is odd')

z is odd

In [100]:
# What if we want even more output options?
# We can use an elif statement as many times as we want.
# In this case, the else statement is a catch-all at the end.

z = 5

if z % 2 == 0:
    print('z is divisible by 2')
elif z % 3 == 0:
    print('z is divisible by 3')
else:
    print('z is neither divisible by 2 nor by 3')

z is neither divisible by 2 nor by 3

In [101]:
# What happens if z = 6 and the if and elif statements are true?
# As soon as we get a True outcome, the code stops.
# We never get to execute the elif statement.

z = 6

if z % 2 == 0:
    print('z is divisible by 2')
elif z % 3 == 0:
    print('z is divisible by 3')
else:
    print('z is neither divisible by 2 nor by 3')

z is divisible by 2

### **Try Problem #14**

## **List, Set, and Dict Comprehensions**

List comprehensions are one of the most used Python language features. They allow you to concisely form a new list by filtering the elements of a collection, transforming the elements, and passing the filter in one concise expression. They take the basic form: 

**[expr for val in collection if condition]**

This is equivalent to the following for loop:

**result = []**

**for val in collection:**

&nbsp;&nbsp;&nbsp;&nbsp;**if condition:**
 
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;**result.append(expr)**

In [102]:
# We have a list of numbers and we want to create a new list.
# The new list will have the original numbers with 1 added to them.
# We could accomplish this with a for loop, but list comprehension is faster.

nums_list = [5, 10, 15, 20, 25]

new_nums = [x + 1 for x in nums_list]
print(new_nums)

[6, 11, 16, 21, 26]

In [103]:
# We can use a list comprehension with any iterable.

result = [num for num in range(11)]
result

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [104]:
# The filter condition can be omitted, leaving only the expression. 
# For each observation in string, make it uppercase if it is longer than 2 letters.

strings = ['a', 'as', 'bat', 'car', 'dove', 'python', 'an']

[x.upper() for x in strings if len(x) > 2]

['BAT', 'CAR', 'DOVE', 'PYTHON']

Nested list comprehensions are a bit hard to understand. The for parts of the list comprehension are arranged according to the order of nesting, and any filter condition is put at the end as before. Here is another example where we 'flatten' a list of tuples of integers into a simple list of integers.

In [105]:
# We can also include conditionals in comprehensions.
# Remember that % is the modulo operator.

[num ** 2 for num in range(10) if num % 2 == 0]

[0, 4, 16, 36, 64]

In [106]:
# For an even integer, output its square.

[num ** 2 if num % 2 == 0 else -99 for num in range(10)]

[0, -99, 4, -99, 16, -99, 36, -99, 64, -99]

### **Try Problem #15**

## **Arithmetic and Data Alignment**

An important pandas feature for some applications is the behavior of arithmetic between objects with different indexes. When you are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs.

In [107]:
# Consider an example with a Series.

s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
print(s1)
print(s2)
print('')
s1 + s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [108]:
# In the case of a DataFrame, alignment is perfomed on both the rows and columns.

df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(df1)
print(df2)
print('')
df1 + df2 
# Because c and e are not in both DFs, they appear as NaNs.
# The same holds true for rows not found in both original DFs.

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [109]:
# Arithmetic with fill values is an option.
# We will create miss matched DFs with an additional missing value.

df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2.loc[1, 'b'] = np.nan # Adding one extra random missing value to df2.
print(df1)
print(df2)
print('')
df1 + df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [110]:
# Use the add method on df1 and pass df2 and an argument to fill_value.
# This will fill the NaN values with values from the single df.

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

## **Sorting and Ranking**

Sorting a dataset by some criterion is another important built-in operation. There are a few different ways to sort Series and DataFrames which we will explore here.

In [111]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [112]:
# Sort the series by index values.

obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [113]:
# With a DataFrame we can sort by index on either axis.

frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['tree', 'open'],
                     columns=['d', 'a', 'b', 'c'])
print(frame)
frame.sort_index()

      d  a  b  c
tree  0  1  2  3
open  4  5  6  7

      d  a  b  c
open  4  5  6  7
tree  0  1  2  3

In [114]:
# Sort by the column values now.

frame.sort_index(axis=1)

      a  b  c  d
tree  1  2  3  0
open  5  6  7  4

In [115]:
# We can also sort in descending order.

frame.sort_index(axis=1, ascending=False)

      d  c  b  a
tree  0  3  2  1
open  4  7  6  5

In [116]:
# Missing values will be sorted to the end of the Series.

obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [118]:
# We can sort DataFrames by the data in one or more columns as the sort keys.
# We must pass one or more column names to the by option of sort_values.

frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [119]:
# Sort the DataFrame by column b.

frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [120]:
# Sort the DataFrame by columns a and b.
# This will first sort all values by a and then within value of a, sort by values of b.

frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

## **Summarizing and Descriptive Statistics**

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of *reductions* or *summary statistics*, mothods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame.

In [121]:
# Look at a DataFrame with missing values.

df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [122]:
# Calculate the sum of a column.

df.sum()

one    9.25
two   -5.80
dtype: float64

In [124]:
# Calculate the sum of across the columns now (ie. sum down a row).

df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [ ]:
df

In [ ]:
# NA values are excluded here unless we disable this option.
# Cannot have a mean value with an NA value if we do not exclude it from the calculation.
# You notice axis=columns and axis=1 result in the same thing.

df.mean(axis='columns')

In [ ]:
# We can also calculate the cumulative sum.
# These methods are known as accumulations.
# This will sum down each column, adding values as it goes.

print(df)
df.cumsum()

In [ ]:
# One very useful method is describe.
# This produces summary statistics in one output.

df.describe()

## **Correlation and Covariance**

Some summary statistics, like correlation and covariance, are computed from pairs of arguments. Let's consider some DataFrames of stock prices and volumes obtained from Yahoo! Finance using a new package, pandas-datareader. You might have to install this package using **pip install pandas_datareader**.

We will use this package to download stock data directly from the internet with one line of code. One nice aspect of Python is how easy it is to obtain data from non-traditional databases such as Yahoo! Finance.

In [132]:
# Download data for a few tickers and create price and volume DataFrames.

import pandas_datareader.data as web

all_data = {ticker: web.get_data_yahoo(ticker, start='2019-1-1', end='2020-2-8') for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

price

ModuleNotFoundError: No module named 'pandas_datareader'

In [ ]:
# We can easily compute the percent change in prices, or returns, of our stocks.
# The first value will always be NaN because percent change requires two prices, this periods and last periods. 

returns = price.pct_change()
returns.head()

In [ ]:
# Corr method computes the correlation of the overlapping non-NA values.
# It requires two Series.

returns['MSFT'].corr(returns['IBM'])

In [ ]:
# If we want to return a full correlation matrix, we call corr() on the DataFrame.

returns.corr()

## **Unique Values, Value Counts, and Membership**

In [133]:
# We can display the unique values in a Series.

obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c','e','e','e','e'])
obj.unique()

array(['c', 'a', 'd', 'b', 'e'], dtype=object)

In [134]:
# We can also compute the value counts for each unique value.

obj.value_counts()

e    4
c    3
a    3
b    2
d    1
dtype: int64

In [135]:
# We can utilize isin as a method of filtering datasets.

obj

0     c
1     a
2     d
3     a
4     a
5     b
6     b
7     c
8     c
9     e
10    e
11    e
12    e
dtype: object

In [136]:
# Make a file of observations that are 'b' or 'c'

mask = obj.isin(['b', 'c'])
mask

0      True
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9     False
10    False
11    False
12    False
dtype: bool

In [137]:
# We can use this to subset obj.

obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object